"""
1. Detect Cycle in List

2. РЈСЂРѕРІРµРЅСЊ
medium

3. РЈСЃР»РѕРІРёРµ
Р”Р°РЅР° РіРѕР»РѕРІР° РѕРґРЅРѕСЃРІСЏР·РЅРѕРіРѕ СЃРїРёСЃРєР° `head`. РћРїСЂРµРґРµР»РёС‚Рµ, СЃРѕРґРµСЂР¶РёС‚ Р»Рё СЃРїРёСЃРѕРє С†РёРєР». Р’РµСЂРЅРёС‚Рµ `true`, РµСЃР»Рё С†РёРєР» РµСЃС‚СЊ, РёРЅР°С‡Рµ `false`.

4. РџСЂРёРјРµСЂ(С‹)
Р’С…РѕРґ: `head = 3 -> 2 -> 0 -> -4`, С…РІРѕСЃС‚ СѓРєР°Р·С‹РІР°РµС‚ РЅР° СѓР·РµР» СЃРѕ Р·РЅР°С‡РµРЅРёРµРј `2`
Р’С‹С…РѕРґ: `true`

Р’С…РѕРґ: `head = 1 -> 2 -> 3`, С†РёРєР» РѕС‚СЃСѓС‚СЃС‚РІСѓРµС‚
Р’С‹С…РѕРґ: `false`
"""
