"""
1. Merge K Sorted Lists

2. РЈСЂРѕРІРµРЅСЊ
hard

3. РЈСЃР»РѕРІРёРµ
Р”Р°РЅ РјР°СЃСЃРёРІ РіРѕР»РѕРІ `lists`, РіРґРµ РєР°Р¶РґС‹Р№ СЌР»РµРјРµРЅС‚ СЏРІР»СЏРµС‚СЃСЏ РіРѕР»РѕРІРѕР№ РѕС‚СЃРѕСЂС‚РёСЂРѕРІР°РЅРЅРѕРіРѕ РѕРґРЅРѕСЃРІСЏР·РЅРѕРіРѕ СЃРїРёСЃРєР°. РћР±СЉРµРґРёРЅРёС‚Рµ РІСЃРµ СЃРїРёСЃРєРё РІ РѕРґРёРЅ РѕС‚СЃРѕСЂС‚РёСЂРѕРІР°РЅРЅС‹Р№ СЃРІСЏР·РЅС‹Р№ СЃРїРёСЃРѕРє Рё РІРµСЂРЅРёС‚Рµ РµРіРѕ РіРѕР»РѕРІСѓ.

4. РџСЂРёРјРµСЂ(С‹)
Р’С…РѕРґ: `lists = [1 -> 4 -> 5, 1 -> 3 -> 4, 2 -> 6]`
Р’С‹С…РѕРґ: `1 -> 1 -> 2 -> 3 -> 4 -> 4 -> 5 -> 6`

Р’С…РѕРґ: `lists = []`
Р’С‹С…РѕРґ: `empty`
"""
