"""
1. Sliding Window Maximum

2. РЈСЂРѕРІРµРЅСЊ
hard

3. РЈСЃР»РѕРІРёРµ
Р”Р°РЅ РјР°СЃСЃРёРІ С†РµР»С‹С… С‡РёСЃРµР» `nums` Рё С‡РёСЃР»Рѕ `k`. Р”Р»СЏ РєР°Р¶РґРѕРіРѕ РѕРєРЅР° РґР»РёРЅС‹ `k` РЅР°Р№РґРёС‚Рµ РјР°РєСЃРёРјР°Р»СЊРЅС‹Р№ СЌР»РµРјРµРЅС‚. РўСЂРµР±СѓРµС‚СЃСЏ РёСЃРїРѕР»СЊР·РѕРІР°С‚СЊ РѕС‡РµСЂРµРґСЊ РёР»Рё РґРІСѓСЃС‚РѕСЂРѕРЅРЅСЋСЋ РѕС‡РµСЂРµРґСЊ РґР»СЏ СЌС„С„РµРєС‚РёРІРЅРѕРіРѕ СЂРµС€РµРЅРёСЏ.

4. РџСЂРёРјРµСЂ(С‹)
Р’С…РѕРґ: `nums = [1, 3, -1, -3, 5, 3, 6, 7], k = 3`
Р’С‹С…РѕРґ: `[3, 3, 5, 5, 6, 7]`

Р’С…РѕРґ: `nums = [4, 2], k = 2`
Р’С‹С…РѕРґ: `[4]`
"""
