"""
1. Daily Temperatures

2. РЈСЂРѕРІРµРЅСЊ
medium

3. РЈСЃР»РѕРІРёРµ
Р”Р°РЅ РјР°СЃСЃРёРІ С†РµР»С‹С… С‡РёСЃРµР» `temperatures`, РіРґРµ `temperatures[i]` СЌС‚Рѕ С‚РµРјРїРµСЂР°С‚СѓСЂР° РІ `i`-Р№ РґРµРЅСЊ. Р”Р»СЏ РєР°Р¶РґРѕРіРѕ РґРЅСЏ РЅР°Р№РґРёС‚Рµ, С‡РµСЂРµР· СЃРєРѕР»СЊРєРѕ РґРЅРµР№ РІСЃС‚СЂРµС‚РёС‚СЃСЏ Р±РѕР»РµРµ РІС‹СЃРѕРєР°СЏ С‚РµРјРїРµСЂР°С‚СѓСЂР°. Р•СЃР»Рё С‚Р°РєРѕРіРѕ РґРЅСЏ РЅРµС‚, СѓРєР°Р¶РёС‚Рµ `0`.

4. РџСЂРёРјРµСЂ(С‹)
Р’С…РѕРґ: `temperatures = [73, 74, 75, 71, 69, 72, 76, 73]`
Р’С‹С…РѕРґ: `[1, 1, 4, 2, 1, 1, 0, 0]`

Р’С…РѕРґ: `temperatures = [30, 40, 50, 60]`
Р’С‹С…РѕРґ: `[1, 1, 1, 0]`
"""
