"""
1. Largest Rectangle Histogram

2. РЈСЂРѕРІРµРЅСЊ
hard

3. РЈСЃР»РѕРІРёРµ
Р”Р°РЅ РјР°СЃСЃРёРІ С†РµР»С‹С… С‡РёСЃРµР» `heights`, РіРґРµ `heights[i]` РѕР±РѕР·РЅР°С‡Р°РµС‚ РІС‹СЃРѕС‚Сѓ `i`-РіРѕ СЃС‚РѕР»Р±С†Р° РіРёСЃС‚РѕРіСЂР°РјРјС‹. РќР°Р№РґРёС‚Рµ РїР»РѕС‰Р°РґСЊ РЅР°РёР±РѕР»СЊС€РµРіРѕ РїСЂСЏРјРѕСѓРіРѕР»СЊРЅРёРєР°, РєРѕС‚РѕСЂС‹Р№ РјРѕР¶РЅРѕ РїРѕСЃС‚СЂРѕРёС‚СЊ РІРЅСѓС‚СЂРё РіРёСЃС‚РѕРіСЂР°РјРјС‹.

4. РџСЂРёРјРµСЂ(С‹)
Р’С…РѕРґ: `heights = [2, 1, 5, 6, 2, 3]`
Р’С‹С…РѕРґ: `10`

Р’С…РѕРґ: `heights = [2, 4]`
Р’С‹С…РѕРґ: `4`
"""
